#!/bin/bash
echo "-----------------------------------------------------------------------------"
curl -s https://raw.githubusercontent.com/razumv/helpers/main/doubletop.sh | bash
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32mНачинаем обновление... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32m1. Стопаем Aptos... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
sudo systemctl stop aptos
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32m2. Скачиваем конфиги... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
rm -f $HOME/aptos/waypoint.txt $HOME/aptos/genesis.blob
wget https://devnet.aptoslabs.com/genesis.blob
wget https://devnet.aptoslabs.com/waypoint.txt
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32m3. Обновляем код... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
cd $HOME/aptos-core
git fetch && git pull
cargo build -p aptos-node --release &> /dev/null
mv $HOME/aptos-core/target/release/aptos-node /usr/local/bin  &> /dev/null
# echo "-----------------------------------------------------------------------------"
# echo -e "\e[1m\e[32m3. Очищаем бд... \e[0m" && sleep 1
# echo "-----------------------------------------------------------------------------"
# rm -rf $HOME/aptos/data
# echo "бд удалена"
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32m4. Запускаем Full-node... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
sudo systemctl start aptos
echo "-----------------------------------------------------------------------------"
echo -e "\e[1m\e[32mОбновление завершено... \e[0m" && sleep 1
echo "-----------------------------------------------------------------------------"
